public class Skill_arr 
{   
	static Skill[] skills = 
	{
	 new Skill("",0,0,0,0),           //0
	 new Skill("몸통박치기",40,1,100,35),
	 new Skill("할퀴기",40,1,100,35),
	 new Skill("막치기",40,1,100,35),
	 new Skill("불꽃세례",45,2,100,25),
	 new Skill("용의숨결",60,2,100,20),
	 new Skill("불꽃엄니",55,1,95,15),
	 new Skill("베어가르기",75,1,100,20),
	 new Skill("화염방사",85,2,100,15),
	 new Skill("안다리걸기",50,1,100,15), 
	 new Skill("바람일으키기",40,2,100,35), //10
	 new Skill("돌떨구기",50,1,100,15),
	 new Skill("물의파동",55,2,100,20),
	 new Skill("거품광선",65,2,100,20),
	 new Skill("전기쇼크",40,2,100,30),
	 new Skill("러스터캐논",80,2,100,10),
	 new Skill("에어슬래시",75,2,100,15),
	 new Skill("환상빔",65,2,100,20),
	 new Skill("독찌르기",80,1,100,20),
	 new Skill("파도타기",100,2,100,15),
	 new Skill("사이코쇼크",80,2,100,10),     //20
	 new Skill("사이코키네시스",90,2,100,10),
	 new Skill("화염자동차",100,1,100,25),
	 new Skill("잎날가르기",55,1,100,25),
	 new Skill("독찌르기",80,1,100,20),
	 new Skill("스톤샤워",75,1,100,10),
	 new Skill("하이드로펌프",120,2,100,5),
	 new Skill("번개",110,2,100,30),
	 new Skill("기가드레인",75,2,100,10),
	 new Skill("미래예지",120,2,100,10),
	 new Skill("플레어드라이브",200,1,100,15),  //30
	 new Skill("덩쿨채찍",45,1,100,15),  
	 new Skill("씨폭탄",65,1,100,15),  
	 new Skill("돌진",75,1,100,15),  
	 new Skill("메가드레인",85,2,100,15),  
	 new Skill("에너지볼",100,2,100,15),  
	 new Skill("이판사판태클",120,1,100,15),  
	 new Skill("솔라빔",200,2,100,15),  
	 new Skill("연옥",120,2,100,15),  
	 new Skill("물대포",45,2,100,15),  
	 new Skill("물기",75,1,100,15),  //40
	 new Skill("아쿠아테일",85,1,100,15),  
	 new Skill("로케트박치기",200,1,100,15),  
	 
	 
	};
			
    
}